# FolderItemInfo Properties

---
The FolderItemInfo type exposes the following members.
| Name| Description
---|---|---
| ElementId| **Obsolete.** The folder parameter Id
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  The folder name
Top
#### Reference
FolderItemInfo Class
Autodesk.Revit.DB Namespace